app/controllers/empleados_controller.rb

SELECT "empleados".* FROM "empleados"
---
  def index
    @empleados = Empleado.all

SELECT "especialidads".* FROM "especialidads" INNER JOIN "empleado_especialidads" ON "especialidads"."id" = "empleado_especialidads"."especialidad_id" WHERE "empleado_especialidads"."empleado_id" = ?  [["empleado_id", 1]]
---
  def show
    @especialidads = @empleado.especialidad.all

INSERT INTO "empleados" ("nombre", "apellido", "rut", "direccion", "correo", "telefono", "fechanacimiento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @empleado = Empleado.new(empleado_params)

    respond_to do |format|
      if @empleado.save

DELETE FROM "empleados" WHERE "empleados"."id" = ?  [["id", 1]]
---
  def destroy
    @empleado.destroy

SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_empleado
      @empleado = Empleado.find(params[:id])