app/controllers/empleado_especialidads_controller.rb

SELECT "empleado_especialidads".* FROM "empleado_especialidads"
---
  def index
    @empleado_especialidads = EmpleadoEspecialidad.all

INSERT INTO "empleado_especialidads" ("empleado_id", "especialidad_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["empleado_id", 1], ["especialidad_id", 2], ["created_at", "2015-10-30 00:24:43.361179"], ["updated_at", "2015-10-30 00:24:43.361179"]]
---
  def create
    @empleado_especialidad = EmpleadoEspecialidad.new(empleado_especialidad_params)

    respond_to do |format|
      if @empleado_especialidad.save

DELETE FROM "empleado_especialidads" WHERE "empleado_especialidads"."id" = ?  [["id", 1]]
---
  def destroy
    @empleado_especialidad.destroy

SELECT  "empleado_especialidads".* FROM "empleado_especialidads" WHERE "empleado_especialidads"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "especialidads".* FROM "especialidads" WHERE "especialidads"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_empleado_especialidad
      @empleado_especialidad = EmpleadoEspecialidad.find(params[:id])