app/controllers/especialidads_controller.rb

SELECT "especialidads".* FROM "especialidads"
---
  def index
    @especialidads = Especialidad.all

SELECT "empleados".* FROM "empleados" INNER JOIN "empleado_especialidads" ON "empleados"."id" = "empleado_especialidads"."empleado_id" WHERE "empleado_especialidads"."especialidad_id" = ?  [["especialidad_id", 1]]
---
  def show
    @empleados =@especialidad.empleado.all

INSERT INTO "especialidads" ("nombre", "detalle", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "postrero"], ["detalle", "todo tipo de postres"], ["created_at", "2015-10-30 00:14:23.028657"], ["updated_at", "2015-10-30 00:14:23.028657"]]
---
  def create
    @especialidad = Especialidad.new(especialidad_params)

    respond_to do |format|
      if @especialidad.save

UPDATE "especialidads" SET "detalle" = ?, "updated_at" = ? WHERE "especialidads"."id" = ?  [["detalle", "especialista en los mejores pasteles"], ["updated_at", "2015-11-03 23:07:34.307415"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @especialidad.update(especialidad_params)

DELETE FROM "especialidads" WHERE "especialidads"."id" = ?  [["id", 1]]
---
  def destroy
    @especialidad.destroy

SELECT  "especialidads".* FROM "especialidads" WHERE "especialidads"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_especialidad
      @especialidad = Especialidad.find(params[:id])