app/controllers/postres_controller.rb

  def index
    @postres = Postre.all
---
SELECT "postres".* FROM "postres"

  def create
    @postre = Postre.new(postre_params)

    respond_to do |format|
      if @postre.save
---
INSERT INTO "postres" ("nombre", "porcion", "precio", "tipopostre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "muffins"], ["porcion", 2], ["precio", 1000], ["tipopostre_id", 1], ["created_at", "2015-10-30 00:15:20.578617"], ["updated_at", "2015-10-30 00:15:20.578617"]]

  def update
    respond_to do |format|
      if @postre.update(postre_params)
---
UPDATE "postres" SET "detalles" = ?, "updated_at" = ? WHERE "postres"."id" = ?  [["detalles", "Pastel de vainilla bañado con una mezcla de tres leches y un ligero toque de brandy, cubierto con betún y trocitos de nuez."], ["updated_at", "2015-11-02 00:23:48.677463"], ["id", 3]]

  def destroy
    @postre.destroy
---
DELETE FROM "postres" WHERE "postres"."id" = ?  [["id", 1]]

    def set_postre
      @postre = Postre.find(params[:id])
---
SELECT  "postres".* FROM "postres" WHERE "postres"."id" = ? LIMIT 1  [["id", 2]]