app/controllers/tipopostres_controller.rb

SELECT "tipopostres".* FROM "tipopostres"
---
  def index
    @tipopostres = Tipopostre.all

INSERT INTO "tipopostres" ("nombre", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "bizcochos"], ["descripcion", "postres hecho de harina y algunos ingredientes mas"], ["created_at", "2015-10-30 00:15:07.063669"], ["updated_at", "2015-10-30 00:15:07.063669"]]
---
  def create
    @tipopostre = Tipopostre.new(tipopostre_params)

    respond_to do |format|
      if @tipopostre.save

UPDATE "tipopostres" SET "nombre" = ?, "updated_at" = ? WHERE "tipopostres"."id" = ?  [["nombre", "Bizcocho"], ["updated_at", "2015-11-02 00:09:22.751956"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @tipopostre.update(tipopostre_params)

DELETE FROM "tipopostres" WHERE "tipopostres"."id" = ?  [["id", 1]]
---
  def destroy
    @tipopostre.destroy

SELECT  "tipopostres".* FROM "tipopostres" WHERE "tipopostres"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_tipopostre
      @tipopostre = Tipopostre.find(params[:id])